erp3l/src/Catalogs/ОбластиДанныхВидовОтчетов/ОбластиДанныхВидовОтчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОбластиДанныхВидовОтчетов</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.ВидыОтчетов</owners>
  <attributes>
    <name>АналитикаОтбор</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыСубконтоКорпоративные</types>
      <types>EnumRef.ТипыАналитикОбластиДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидАналитики</name>
    <type>
      <types>EnumRef.ТипыАналитикОбластиДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.РолиКонтактныхЛиц</types>
    </type>
  </attributes>
  <attributes>
    <name>Согласование</name>
    <type>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.ШаблоныУниверсальныхПроцессов</types>
      <types>CatalogRef.РолиКонтактныхЛиц</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОтчета</name>
    <type>
      <types>CatalogRef.ВидыОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеАналитики</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтборыАналитки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПравилоОбработки</name>
    <type>
      <types>CatalogRef.ПравилаОбработки</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоОбластьГруппа</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазделятьПоОрганизациям</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазделятьПоПроектам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>БланкОтображения</name>
    <type>
      <types>CatalogRef.БланкиОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВключатьВсеПоказателиВидаОтчета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>БланкиДляОтображения</name>
    <attributes>
      <name>Бланк</name>
      <type>
        <types>CatalogRef.БланкиОтчетов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоставОбласти</name>
    <attributes>
      <name>Область</name>
      <type>
        <types>CatalogRef.ОбластиДанныхВидовОтчетов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

erp3l/src/Catalogs/ДокументыБД/ДокументыБД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДокументыБД</name>
  <comment>Содержит реквизиты, необходимые для выборки данных из текущей и внешних информационных баз</comment>
  <hierarchical>true</hierarchical>
  <owners>Catalog.ТипыБазДанных</owners>
  <attributes>
    <name>Синоним</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъектаМетаданных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяОбъектаМетаданных</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыСубконтоКорпоративные</types>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НастройкиОбменаДокументами</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздаватьПриНеудачномПоискеПриИмпорте</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбновлятьРеквизитыПриИмпорте</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяВПроцессе</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипДокументаБД</name>
    <type>
      <types>EnumRef.ТипыДокументовБД</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонДокументаБД</name>
    <type>
      <types>DefinedType.ШаблонДокументаБД</types>
    </type>
  </attributes>
  <attributes>
    <name>Согласуется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитСостояния</name>
    <type>
      <types>CatalogRef.ПеречисленияБД</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеРеквизитаСостоянияНаУтверждении</name>
    <type>
      <types>EnumRef</types>
      <types>CatalogRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеРеквизитаСостоянияУтвержден</name>
    <type>
      <types>EnumRef</types>
      <types>CatalogRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеРеквизитаСостоянияОтклонен</name>
    <type>
      <types>EnumRef</types>
      <types>CatalogRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьШаблоны</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитШаблонаДокумета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДляАналитики1УП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДляАналитики2УП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДляАналитики3УП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяВНастройкахРеглмента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьПравилоРасчета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьПравилоПроверки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьБланк</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьСпособФормирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьУниверсальныйИмпорт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеРеквизитаСостоянияЧерновик</name>
    <type>
      <types>EnumRef</types>
      <types>CatalogRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьШаблонТрансляции</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчастокУчета</name>
    <type>
      <types>CatalogRef.УчасткиУчета</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитСостоянияСтрока</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитРазделенияПоПроектам</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазделятьПоПроектам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазделятьПоОрганизациям</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитРазделенияПоОрганизациям</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитКонтрагент</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДоговорКонтрагента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитСуммыДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеБлокироватьРеквизитыПриУтверждении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтсутствуетВКонфигурации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьОтсутствуетВКонфигурации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Реквизиты</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Синоним</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипДанных</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Обязательный</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИспользоватьДляСогласования</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Отображать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерАналитики</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеПримитивногоТипа</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДопРеквизитыМатрицыПроцесса</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДоступныеФормыСхемРеквизитов</name>
    <attributes>
      <name>ИмяДоступнойФормы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УдалитьДоступныеФормыСхемРеквизитов</name>
    <attributes>
      <name>ИмяДоступнойФормы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

erp3l/src/Catalogs/ОбластиДанныхВидовОтчетов/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	 //Новый ракурс создается только в том случае, если нет ракурса, содержащего все строки 
	 Запрос = Новый Запрос;
	 Запрос.Текст = "ВЫБРАТЬ
	                |	ОбластиДанныхВидовОтчетов.Ссылка
	                |ИЗ
	                |	Справочник.ОбластиДанныхВидовОтчетов КАК ОбластиДанныхВидовОтчетов
	                |ГДЕ
	                |	ОбластиДанныхВидовОтчетов.ВключатьВсеПоказателиВидаОтчета = ИСТИНА
	                |	И ОбластиДанныхВидовОтчетов.ПометкаУдаления = ЛОЖЬ
	                |	И ОбластиДанныхВидовОтчетов.Владелец = &Владелец
	                |	И НЕ ОбластиДанныхВидовОтчетов.Ссылка = &Ссылка";
	 
	 Запрос.УстановитьПараметр("Владелец",Объект.Владелец);
	 Запрос.УстановитьПараметр("Ссылка",Объект.Ссылка);
	 
	 Результат = Запрос.Выполнить();
	 Выборка = Результат.Выбрать();
	 
	 Пока Выборка.Следующий() Цикл	 
		 ВызватьИсключение(Нстр("ru = ' Создание нового ракурса запрещено: существует ракурс, содержащий все строки отчетов '"));
		 Отказ = Истина;  
	 КонецЦикла;
	 	
	ДокументБД = Справочники.ДокументыБД.НайтиПоНаименованию("РакурсДанных",,,Справочники.ТипыБазДанных.ТекущаяИБ);
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		РабочийОбъект = РеквизитФормыВзначение("Объект");	
		РабочийОбъект.ПолучитьВыбранныеПоказатели(Строки);
							
	КонецЕсли;
	
	УстановитьВидимостьЭлементов();

	СоставСтрок = ?(Объект.ВключатьВсеПоказателиВидаОтчета,"ВсеСтроки","ВыбранныеСтроки");
	
	Элементы.РазделятьПоПроектам.Видимость = Объект.Владелец.РазделениеПоПроектам;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	НастройкиСоставаОбластейВидовОтчетов = РегистрыСведений.НастройкиСоставаОбластейВидовОтчетов.СоздатьНаборЗаписей();
	НастройкиСоставаОбластейВидовОтчетов.Отбор.КлючОбласти.Установить(Объект.Ссылка);
	
	Для Каждого Стр Из Строки Цикл		
		мНастройкиСоставаОбластейВидовОтчетов = НастройкиСоставаОбластейВидовОтчетов.Добавить();	
		мНастройкиСоставаОбластейВидовОтчетов.КлючОбласти = Объект.Ссылка;
		мНастройкиСоставаОбластейВидовОтчетов.СтрокаОтчета = Стр.Значение;
		мНастройкиСоставаОбластейВидовОтчетов.ОрганизационнаяЕдиница = Объект.Организация;
		мНастройкиСоставаОбластейВидовОтчетов.Проект = Объект.Проект;		
	КонецЦикла;
	
	НастройкиСоставаОбластейВидовОтчетов.Записать(Истина);
		
	 //Если есть бланки, связанные с ракурсом, обновим структуру 
	 Запрос = Новый Запрос;
	 Запрос.Текст = "ВЫБРАТЬ
	 |	БланкиОтчетов.Ссылка
	 |ИЗ
	 |	Справочник.БланкиОтчетов КАК БланкиОтчетов
	 |ГДЕ
	 |	БланкиОтчетов.ПометкаУдаления = Ложь
	 |	И БланкиОтчетов.Ракурс = &Ракурс";
	 
	 Запрос.УстановитьПараметр("Ракурс",Объект.Ссылка);
	 
	 Результат = Запрос.Выполнить();
	 Выборка = Результат.Выбрать();
	 
	 Пока Выборка.Следующий() Цикл 
	 	  СводнаяТаблицаУХ.ЗаполнитьСтрокиПоРакурсу(Объект.Ссылка,Выборка.Ссылка); 
	 КонецЦикла;

	УстановитьВидимостьЭлементов();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	
	Если  ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Если Объект.ВключатьВсеПоказателиВидаОтчета <> Объект.Ссылка.ВключатьВсеПоказателиВидаОтчета 
			ИЛИ Объект.РазделятьПоОрганизациям <> Объект.Ссылка.РазделятьПоОрганизациям 
			ИЛИ Объект.РазделятьПоПроектам <> Объект.Ссылка.РазделятьПоПроектам ИЛИ
			ИзмененСоставСтрок Тогда
			Если  ПроверитьНаличиеСогласуемыхДанных() Тогда
				
				СтрокаШаблона = НСтр("ru = 'По ракурсу %1 существуют данные показателей отчетов, находящиеся в статусе отличном от статуса ""черновик"". Изменение настроек ракурса запрещено.'");
				
				Если Не ПустаяСтрока(СтрокаШаблона) тогда				
					ОбщегоНазначенияУХ.СообщитьОбОшибке(СтрШаблон(СтрокаШаблона, Объект.Наименование));
				КонецЕсли;
				
				Отказ = Истина;		
				
			КонецЕсли;			
		КонецЕсли;		
	КонецЕсли;
	
	Если Объект.ВключатьВсеПоказателиВидаОтчета Тогда	
		Возврат;	
	КонецЕсли;	
	
	
	Если НЕ Объект.ЭтоГруппа Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	НастройкиСоставаОбластейВидовОтчетов.КлючОбласти
		|ИЗ
		|	РегистрСведений.НастройкиСоставаОбластейВидовОтчетов КАК НастройкиСоставаОбластейВидовОтчетов
		|ГДЕ
		|	НастройкиСоставаОбластейВидовОтчетов.КлючОбласти <> &КлючОбласти
		|	И НастройкиСоставаОбластейВидовОтчетов.СтрокаОтчета В(&СтрокаОтчета)";
		
		
		Если ЗначениеЗаполнено(Объект.Организация) Тогда
			
			Запрос.Текст =  Запрос.Текст+"
			|	И ВЫБОР
			|			КОГДА НастройкиСоставаОбластейВидовОтчетов.ОрганизационнаяЕдиница = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
			|				ТОГДА ИСТИНА
			|			ИНАЧЕ НастройкиСоставаОбластейВидовОтчетов.ОрганизационнаяЕдиница = &ОрганизационнаяЕдиница
			|		КОНЕЦ ";
			Запрос.УстановитьПараметр("ОрганизационнаяЕдиница",Объект.Организация);
			
		КонецЕсли;
		
		
		Если ЗначениеЗаполнено(Объект.Организация) Тогда
			
			Запрос.Текст =  Запрос.Текст+"
			|	И ВЫБОР
			|			КОГДА НастройкиСоставаОбластейВидовОтчетов.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
			|				ТОГДА ИСТИНА
			|			ИНАЧЕ НастройкиСоставаОбластейВидовОтчетов.Проект = &Проект
			|		КОНЕЦ ";
			
			Запрос.УстановитьПараметр("Проект",Объект.Проект);
			
		КонецЕсли;
			
		Запрос.УстановитьПараметр("КлючОбласти",Объект.Ссылка);	
		Запрос.УстановитьПараметр("СтрокаОтчета",Строки.ВыгрузитьЗначения());
			
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			СтрокаШаблона = НСтр("ru = 'Ошибка сохранения элемента: %1. Данные элемента пересекаются с данными области %2'");
			
			Если Не ПустаяСтрока(СтрокаШаблона) тогда				
				ОбщегоНазначенияУХ.СообщитьОбОшибке(СтрШаблон(СтрокаШаблона, Объект.Наименование, Выборка.КлючОбласти));
			КонецЕсли;
			
			Отказ = Истина;
			
		КонецЦикла;
			
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиОповещенийФормы

&НаКлиенте
Процедура ВыборСтрокЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено ИЛИ Результат = КодВозвратаДиалога.Отмена   Тогда
		 Возврат;
	КонецЕсли;	

	Строки.ЗагрузитьЗначения(Результат);	
	УстановитьВидимостьЭлементов();
	ЭтаФорма.Модифицированность = Истина;
	ИзмененСоставСтрок = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура НастройкаПолномочий(Команда)
	
	Если ЭтаФорма.Модифицированность Тогда	
		ЭтаФорма.Записать();	
	КонецЕсли;	
		
	ОткрытьФорму("Обработка.СводнаяТаблица.Форма.ФормаУправленияМатрицейПолномочий", Новый Структура("ВерсияОрганизационнойСтруктуры,ОбъектБД,ШаблонДокументаБД", Неопределено,ДокументБД,Объект.Ссылка));

КонецПроцедуры

&НаКлиенте
Процедура СоставСтрокПриИзменении(Элемент)
	
	Если СоставСтрок = "ВсеСтроки" Тогда
		Объект.ВключатьВсеПоказателиВидаОтчета = Истина;			
	Иначе		
		Объект.ВключатьВсеПоказателиВидаОтчета = Ложь;	
	КонецЕсли;	
	
	ЭтаФорма.Модифицированность = Истина;
	УстановитьВидимостьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура ВключатьВсеПоказателиВидаОтчетаПриИзменении(Элемент)
	
	Элементы.Строки.Доступность = НЕ Объект.ВключатьВсеПоказателиВидаОтчета;
	
КонецПроцедуры

&НаКлиенте
Процедура СтрокиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;	
	
	Параметры_ = Новый Структура;	
	Параметры_.Вставить("ВидОтчета",Объект.Владелец);
	Параметры_.Вставить("МножественныйВыбор",Истина);
	Параметры_.Вставить("СписокСтрок",Строки);
	Параметры_.Вставить("Ракурс",Объект.Ссылка);

	Оповещение = Новый ОписаниеОповещения("ВыборСтрокЗавершение",ЭтаФорма);
	ОткрытьФорму("Справочник.СтрокиОтчетов.Форма.ФормаПодбораСтрокРакурса",Параметры_,,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ЗаписатьОбъект()
	
	РабочийОбъект = РеквизитФормыВЗначение("Объект");	
	РабочийОбъект.Записать();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЭлементов()
		
	Элементы.Строки.Видимость = НЕ Объект.ВключатьВсеПоказателиВидаОтчета;	
		
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если НЕ Объект.ВключатьВсеПоказателиВидаОтчета Тогда
		ПроверяемыеРеквизиты.Добавить("Строки");
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Функция ПроверитьНаличиеСогласуемыхДанных() 
	
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	ЗначенияСтатусовПоказателейСинтетика.ОбластьДанных
	                |ИЗ
	                |	РегистрСведений.ЗначенияСтатусовПоказателейСинтетика КАК ЗначенияСтатусовПоказателейСинтетика
	                |ГДЕ
	                |	ЗначенияСтатусовПоказателейСинтетика.ОбластьДанных = &ОбластьДанных
	                |	И ЗначенияСтатусовПоказателейСинтетика.ИндексСостояния <> 0";
					 
	Запрос.УстановитьПараметр("ОбластьДанных",Объект.Ссылка);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл		
		
		Возврат Истина;
		
	КонецЦикла;

	Возврат Ложь;
	
КонецФункции
